Ра_новая/src/Tasks/ЗадачаПользователя/ЗадачаПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>ЗадачаПользователя</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Испольнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий_Исполнитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий_Проверяющий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проверяющий</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗадач</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Участники</name>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КомментарииИФайлы</name>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаФайл</name>
      <type>
        <types>CatalogRef.ЗадачаПользователяФайлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Task>

Ра_новая/src/Enums/СтатусыЗадач/СтатусыЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗадач</name>
  <enumValues>
    <name>Выполнено</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>НадоСделать</name>
  </enumValues>
  <enumValues>
    <name>НаПроверке</name>
  </enumValues>
  <enumValues>
    <name>Отложена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

Ра_новая/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <attributes>
    <name>ДатаВыдачиПаспорта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриемаНаРаботу</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПаспорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПаспортВыдан</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерияПаспорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭлПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Ра_новая/src/Catalogs/ЗадачаПользователяФайлы/ЗадачаПользователяФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗадачаПользователяФайлы</name>
  <attributes>
    <name>ВладелецФайла</name>
    <type>
      <types>TaskRef.ЗадачаПользователя</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТекущаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

Ра_новая/src/Tasks/ЗадачаПользователя/Forms/ФормаЗадачи/Module.bsl
&НаКлиенте
Процедура EmailИсполнителю(Команда)
	
	Если ЗначениеЗаполнено(Объект.Испольнитель) Тогда
		СтруктураИсполнитель = ПроверитьНаличиеЭлПочтыПользователя(Объект.Испольнитель);

		Профиль = ПолучитьИнтернетПочтовыйПрофиль();

		Письмо 					= Новый ИнтернетПочтовоеСообщение;

		Текст = Письмо.Тексты.Добавить("Новая задача: " + Объект.Описание);
		Текст.ТипТекста 		= ТипТекстаПочтовогоСообщения.ПростойТекст;

		Текст = Письмо.Тексты.Добавить("Н: " + Объект.Номер);
		Текст.ТипТекста 		= ТипТекстаПочтовогоСообщения.ПростойТекст;

		Письмо.Тема 			= "Новая задача: " + Объект.Наименование;
		Письмо.Отправитель 		= "SharedFormail@yandex.ru";
		Письмо.ИмяОтправителя 	= "Робот";
		Письмо.Получатели.Добавить(СтруктураИсполнитель.ЭлПочта);

		Почта = Новый ИнтернетПочта;
		Попытка
			Почта.Подключиться(Профиль);
		Исключение
			Сообщить("Не удалось подключиться к серверу");
			Сообщить(ОписаниеОшибки());
		КонецПопытки;

		Попытка
			Почта.Послать(Письмо);
			Сообщить("Письмо отправлено");
		Исключение
			Сообщить("Не удалось отправить письмо");
			Сообщить(ОписаниеОшибки());
		КонецПопытки;

		Почта.Отключиться();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Email(Команда)
	
	Структура = ПроверитьНаличиеЭлПочтыПользователя(Объект.Испольнитель);
	
	Если Структура.ЕстьЭлАдрес Тогда 
//		Профиль = Новый ИнтернетПочтовыйПрофиль;      					
//		Профиль.АдресСервераSMTP 	= "smtp.yandex.ru";  			
//		Профиль.ПользовательSMTP 	= "SharedForMail@yandex.ru";	
//		Профиль.ПарольSMTP         	= "9gPsUynm";					
//		Профиль.ИспользоватьSSLSMTP = Истина;                 		
//		Профиль.ПортSMTP 			= 465; 							 
//		Профиль.АутентификацияSMTP 	= СпособSMTPАутентификации.Login; 
		
		Профиль = ПолучитьИнтернетПочтовыйПрофиль();
		
		Письмо 					= Новый ИнтернетПочтовоеСообщение;
		Текст 					= Письмо.Тексты.Добавить("Описание: "+Объект.Описание);
		Текст.ТипТекста 		= ТипТекстаПочтовогоСообщения.ПростойТекст;
		Письмо.Тема 			= "Новое задание: "+Объект.Наименование; 
		Письмо.Отправитель 		= "SharedFormail@yandex.ru";
		Письмо.ИмяОтправителя 	= "Робот";
		Письмо.Получатели.Добавить(Структура.ЭлПочта);
		
		Почта = Новый ИнтернетПочта;
		Попытка
			Почта.Подключиться(Профиль);
		Исключение
			Сообщить("Не удалось подключиться к серверу");
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
		Попытка
			Почта.Послать(Письмо);
			Сообщить("Письмо отправлено");
		Исключение
			Сообщить("Не удалось отправить письмо");
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
		Почта.Отключиться();
	иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "У Исполнителя не заполнен e-mail";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура EmailКомментарий(Команда)
	
	СтруктураАвтор = ПроверитьНаличиеЭлПочтыПользователя(Объект.Автор);
	Если Объект.Автор <> Объект.Проверяющий Тогда 
		СтруктураПроверяющий = ПроверитьНаличиеЭлПочтыПользователя(Объект.Проверяющий);
	КонецЕсли;

//	Профиль = Новый ИнтернетПочтовыйПрофиль;
//	Профиль.АдресСервераSMTP 	= "smtp.yandex.ru";
//	Профиль.ПользовательSMTP 	= "SharedForMail@yandex.ru";
//	Профиль.ПарольSMTP         	= "9gPsUynm";
//	Профиль.ИспользоватьSSLSMTP = Истина;
//	Профиль.ПортSMTP 			= 465;
//	Профиль.АутентификацияSMTP 	= СпособSMTPАутентификации.Login;

	Профиль = ПолучитьИнтернетПочтовыйПрофиль();

	текСтрока = Элементы.КомментарииИФайлы.ТекущиеДанные;
	Письмо 					= Новый ИнтернетПочтовоеСообщение;

	Текст = Письмо.Тексты.Добавить("Комментарий " + текСтрока.ИсходныйНомерСтроки + ": " + текСтрока.Комментарий);
	Текст.ТипТекста 		= ТипТекстаПочтовогоСообщения.ПростойТекст;

	Письмо.Тема 			= "Новый комментарий по задаче: " + Объект.Наименование;
	Письмо.Отправитель 		= "SharedFormail@yandex.ru";
	Письмо.ИмяОтправителя 	= "Робот";
	Письмо.Получатели.Добавить(СтруктураАвтор.ЭлПочта);
	Если Объект.Автор <> Объект.Проверяющий Тогда 
		Письмо.Получатели.Добавить(СтруктураПроверяющий.ЭлПочта);
	КонецЕсли;
	
	// Письмо.Получатели.Добавить("Smirnofrv@yandex.ru"); //СЛУЖЕБНЫЙ 

	Почта = Новый ИнтернетПочта;
	Попытка
		Почта.Подключиться(Профиль);
	Исключение
		Сообщить("Не удалось подключиться к серверу");
		Сообщить(ОписаниеОшибки());
	КонецПопытки;

	Попытка
		Почта.Послать(Письмо);
		Сообщить("Письмо отправлено");
	Исключение
		Сообщить("Не удалось отправить письмо");
		Сообщить(ОписаниеОшибки());
	КонецПопытки;

	Почта.Отключиться();
		
КонецПроцедуры

&НаСервере
Функция ПолучитьИнтернетПочтовыйПрофиль()
	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	Профиль.АдресСервераSMTP 	= "smtp.yandex.ru";
	Профиль.ПользовательSMTP 	= "SharedForMail@yandex.ru";
	Профиль.ПарольSMTP         	= "9gPsUynm";
	Профиль.ИспользоватьSSLSMTP = Истина;
	Профиль.ПортSMTP 			= 465;
	Профиль.АутентификацияSMTP 	= СпособSMTPАутентификации.Login;
	
	Возврат Профиль;
КонецФункции
   
&НаСервере
Функция ПроверитьНаличиеЭлПочтыПользователя(Пользователь)
	
	ЭлПочта = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.ЭлПочта КАК ЭлПочта
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЭлПочта = ВыборкаДетальныеЗаписи.ЭлПочта;	
	КонецЦикла;

	Структура = Новый Структура;
	Если ЗначениеЗаполнено(ЭлПочта) Тогда 
		Структура.Вставить("ЕстьЭлАдрес",Истина);
		Структура.Вставить("ЭлПочта",ЭлПочта);
	Иначе 
		Структура.Вставить("ЕстьЭлАдрес",Ложь);
		Структура.Вставить("ЭлПочта","");
	КонецЕсли;	
	
	Возврат Структура;	
КонецФункции	

&НаКлиенте
Процедура ПередВыполнением(Отказ)
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗадач.Выполнено");	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	СформироватьHTML();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьHTML()
	
	сНаименование = "№"+Объект.Номер+" "+Объект.Наименование;
	
	Структура  = Новый Структура("Наименование", сНаименование);
	
	ТекстHTML = ОбщегоНазначенияВызовСервера.СформироватьHTML(Структура);
	
	сТело2 = "";
	
	Для Каждого строкаКоментария из Объект.КомментарииИФайлы Цикл 
		Если ЗначениеЗаполнено(строкаКоментария.Комментарий) Тогда
			сТело2=сТело2 + "<p>";
			сТело2=сТело2 + ОбщегоНазначенияВызовСервера.ПолучитьТекстHTMLДляСворачиваемогоТекста("Комментарий 	"
				+ строкаКоментария.НомерСтроки, строкаКоментария.Комментарий);
			сТело2=сТело2 + "</p>";
		КонецЕсли;
	
		Если ЗначениеЗаполнено(строкаКоментария.СсылкаНаФайл) Тогда
			ТекКартинка = ПолучитьНавигационнуюСсылку(строкаКоментария.СсылкаНаФайл, "ФайлХранилище");
			сТело2=сТело2+"<img src="+ТекКартинка+">";	
		КонецЕсли;		
	КонецЦикла;	
	
	ТекстHTML = ТекстHTML+сТело2;

КонецПроцедуры	

&НаКлиенте
Процедура КомментарииИФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Не Поле.Имя = "КомментарииИФайлыСсылкаНаФайл" Тогда
		СтрутураПараметров = Новый Структура;
		текСтрока = Элементы.КомментарииИФайлы.ТекущиеДанные;
		СтрутураПараметров.Вставить("Комментарий", текСтрока.Комментарий);
		ОткрытьФорму("Задача.ЗадачаПользователя.Форма.ФормаКомментария", СтрутураПараметров);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайлы()
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		УИД = Новый УникальныйИдентификатор();
		Оповещение  =  Новый ОписаниеОповещения("ОбработатьВыборФайла",   ЭтотОбъект);
		НачатьПомещениеФайла(Оповещение,   ,   ,   Истина,   УИД);
		//НачатьПомещениеФайлаНаСервер(Оповещение,,,,,УИД);
	Иначе 
		Оповещение = Новый ОписаниеОповещения("ОтветНаВопросЗаписать", ЭтотОбъект);
		ТекстВопроса = "Элемент не записан, Записать?";                            
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);	
 	КонецЕсли;	
КонецПроцедуры

&НаКлиенте 
Процедура ОтветНаВопросЗаписать(Результат, ДополнительныеПараметры) Экспорт 
	Если Результат = КодВозвратаДиалога.Да Тогда
		 ЭтотОбъект.Записать();
		 ДобавитьФайлы();
	КонецЕсли;
КонецПроцедуры 

&НаСервере 
Функция  ПолучитьЗапасыИзХранилища(АдресВХранилище)
        Комментарий =ПолучитьИзВременногоХранилища(АдресВХранилище);		
		Возврат Комментарий;
КонецФункции

&НаКлиенте
Процедура ОбработатьВыборФайла(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	Если Не Результат Тогда
		Возврат; 
	КонецЕсли;
	
	//Записать();
	
	//Получим данные файла
	ОписаниеФайла = Новый Файл(ВыбранноеИмяФайла);

	//Сохраним в справочник ХранилищеФайлов
	СохранитьФайлВХранилище(Адрес,Объект.Ссылка,ОписаниеФайла.ИмяБезРасширения, Элементы.КомментарииИФайлы.ТекущаяСтрока);	
 	
	ЭтаФорма.Прочитать();

	СформироватьHTML();

КонецПроцедуры

&НаСервере
Процедура СохранитьФайлВХранилище(Адрес,Владелец,Имя,номСтрокиТЧ)  	
	Структура = Новый Структура;
	Структура.Вставить("Владелец",Владелец);
	Структура.Вставить("Имя",Имя);
	
	Существует = ПроверитьУникальность(Структура);
	
	Если Существует Тогда 
		Сообщить("Файл существует, добавьте другой");
	Иначе 
		НовФайл = Справочники.ЗадачаПользователяФайлы.СоздатьЭлемент();
		НовФайл.ВладелецФайла 	= Владелец;
		НовФайл.Наименование 	= Имя;
		НовФайл.ДанныеТекущаяДата = ТекущаяДата();
		НовФайл.ФайлХранилище = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Адрес));
		НовФайл.Записать();
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Функция ПроверитьУникальность(Структура)
	
	Существует = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачаПользователяФайлы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЗадачаПользователяФайлы КАК ЗадачаПользователяФайлы
		|ГДЕ
		|	ЗадачаПользователяФайлы.ВладелецФайла = &ВладелецФайла
		|	И ЗадачаПользователяФайлы.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("ВладелецФайла", Структура.Владелец);
	Запрос.УстановитьПараметр("Наименование", Структура.Имя);
	
	РезультатЗапроса = Запрос.Выполнить();

	Существует = Не РезультатЗапроса.Пустой();
	
	Возврат Существует;
	
КонецФункции
	
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия="ТекущийКомментарий"  Тогда
		Если ЗначениеЗаполнено(Параметр) Тогда
			текСтрока = Элементы.КомментарииИФайлы.ТекущиеДанные;
			текСтрока.Комментарий = ПолучитьЗапасыИзХранилища(Параметр);
			Модифицированность = Истина; 
			
			СформироватьHTML();
			
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайл(Команда)
	ДобавитьФайлы();
КонецПроцедуры
